Terraform plan for __staging__
<details>
  <summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_limit_range.cluster_limit["handler"] will be created
  + resource "kubernetes_limit_range" "cluster_limit" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "default-limit"
          + namespace        = "handler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + limit {
              + default         = {
                  + "memory" = "1Gi"
                }
              + default_request = {
                  + "cpu"    = "500m"
                  + "memory" = "1Gi"
                }
              + type            = "Container"
            }
        }
    }

  # kubernetes_namespace.gke_namespace["handler"] will be created
  + resource "kubernetes_namespace" "gke_namespace" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "handler"
            }
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "enabled"
              + "project"         = "ebo-staging"
            }
          + name             = "handler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.handler_service_account will be created
  + resource "kubernetes_service_account" "handler_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "handler-service@ebo-staging.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "handler-service"
          + namespace        = "handler"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #196](https://github.com/ebomart/commerce-infrastructure/actions/runs/1285353854)